<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [9]:
import pandas as pd
import numpy as np

In [10]:
data = pd.read_csv('test_data.txt')

In [11]:
data.head()

   a    b  c    d
0  1  2.0  3  4.0
1  5  6.0  7  8.0
2  1  3.0  5  7.0
3  2  4.0  6  9.0
4  1  NaN  9  NaN

View NA

In [12]:
np.sum(data.isnull(), axis = 0)

a    0
b    1
c    0
d    1
dtype: int64

Fill NA

In [14]:
data['b']=data['b'].fillna(data['b'].mean())
data['d']=data['d'].fillna(data['d'].mean())

In [15]:
data.head()

   a    b  c    d
0  1  2.0  3  4.0
1  5  6.0  7  8.0
2  1  3.0  5  7.0
3  2  4.0  6  9.0
4  1  4.6  9  7.2

Apply to column

In [18]:
data['XX']=data['a'].apply(lambda x: x*x)
data.head()

   a    b  c    d  XX
0  1  2.0  3  4.0   1
1  5  6.0  7  8.0  25
2  1  3.0  5  7.0   1
3  2  4.0  6  9.0   4
4  1  4.6  9  7.2   1

In [19]:
data.groupby('a').aggregate(lambda x: np.mean(x['XX']))

      b     c     d    XX
a
1   1.0   1.0   1.0   1.0
2   4.0   4.0   4.0   4.0
5  25.0  25.0  25.0  25.0
8  64.0  64.0  64.0  64.0

In [21]:
data[data.a>1]

   a    b  c    d  XX
1  5  6.0  7  8.0  25
3  2  4.0  6  9.0   4
5  8  8.0  8  8.0  64

In [22]:
data.loc[data.a>1,:]

   a    b  c    d  XX
1  5  6.0  7  8.0  25
3  2  4.0  6  9.0   4
5  8  8.0  8  8.0  64

In [23]:
data.query('a>1')

   a    b  c    d  XX
1  5  6.0  7  8.0  25
3  2  4.0  6  9.0   4
5  8  8.0  8  8.0  64